# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [2]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names = pd.read_csv('US_Baby_Names_right.csv')
baby_names.head(5)

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 4. See the first 10 entries

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [6]:
baby_names.drop(axis=1, labels=['Unnamed: 0', 'Id'], inplace=True)

### Step 6. Is there more male or female names in the dataset?

In [8]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [10]:
names = baby_names.groupby(['Name']).sum()
names.head(5)

           Year  Count
Name
Aaban      4027     12
Aadan      8039     23
Aadarsh    2009      5
Aaden    393963   3426
Aadhav     2014      6

### Step 8. How many different names exist in the dataset?

In [11]:
len(names)

17632

### Step 9. What is the name with most occurrences?

In [13]:
names.sort_values('Count', ascending=False)

                Year   Count
Name
Jacob        1141099  242874
Emma         1137085  214852
Michael      1161152  214405
Ethan        1139091  209277
Isabella     1137090  204798
William      1131058  197894
Joshua       1141085  191551
Sophia       1131067  191446
Daniel       1163179  191440
Emily        1135066  190318
Olivia       1137088  188036
Alexander    1163159  187189
Matthew      1135070  185279
Noah         1217482  179925
Anthony      1139087  179256
Andrew       1133065  174975
Christopher  1149113  172997
Joseph       1141093  169972
David        1135069  167606
Ava          1139102  167369
Madison      1181245  166959
Jayden       2071183  166864
James        1139095  162429
Logan        1922577  158186
Ryan         1810045  156507
Abigail      1129053  156236
Mason        1273620  149221
Benjamin     1137089  145867
Aiden        1277634  145774
Elijah       1145107  142851
...              ...     ...
Assata          2014       5
Siris           2008       5
Sirus           2005       5
Mansoor         2006       5
Sitlali         2005       5
Marcelle        2004       5
Athos           2012       5
Atiya           2008       5
Sila            2013       5
Emron           2006       5
Margret         2004       5
Emunah          2013       5
Emya            2009       5
Aubrea          2007       5
Siennah         2012       5
Marena          2004       5
Endi            2006       5
Atzi            2009       5
Siler           2011       5
Atlanta         2013       5
Marcuz          2014       5
Eneida          2006       5
Enes            2013       5
Atleigh         2014       5
Marcjacob       2013       5
Eniola          2012       5
Atlantis        2005       5
Marci           2004       5
Simarpreet      2011       5
Nita            2007       5

[17632 rows x 2 columns]

### Step 10. How many different names have the least occurrences?

In [15]:
len(names[names.Count== names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [16]:
names.Count.median()

49.0

### Step 12. What is the standard deviation of names?

In [17]:
names.Count.std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [18]:
names.Count.describe()

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64